web-prover/doc/api.org
#+TITLE: Web prototype API
#+STARTUP: showall

* Current versions

- stable api version: v1.0
- development api version: v1.1

* Overview

This api is versioned: Galois will endevour to keep at least the
current 'stable' api and the current 'development' api around.  For
simplicity, the version covers the entirity of the service: it is
expected, however, that most types and operations will be the same
between API versions.

This document tends towards the pedantic; sorry.

* Conventions

The URI for all operations include the version number, so
: /v1.0/browse/
is the URI for the root 'browse' page.  The latest 'stable' version
will be located at the root, so
: /browse
accesses the stable version of browse.

In the following, all URIs are relative to the api version, so 
: browse/
is understood to be
: /v1.0/browse 
for version 1.0 of the API.

One notable exception is this document: the latest version is always
: /api.html

