web-prover/doc/api.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Web prototype API</title>
<!-- 2014-04-22 Tue 02:16 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Simon Winwood" />
</head>
<body>
<div id="content">
<h1 class="title">Web prototype API</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Current versions</a></li>
<li><a href="#sec-2">2. Overview</a></li>
<li><a href="#sec-3">3. Conventions</a></li>
<li><a href="#sec-4">4. Terminology and concepts</a></li>
<li><a href="#sec-5">5. API v1.0</a>
<ul>
<li><a href="#sec-5-1">5.1. Types</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1. TypeT</a></li>
<li><a href="#sec-5-1-2">5.1.2. ExprStruct</a></li>
<li><a href="#sec-5-1-3">5.1.3. Expr</a></li>
<li><a href="#sec-5-1-4">5.1.4. FunSolution</a></li>
<li><a href="#sec-5-1-5">5.1.5. CallInfo</a></li>
<li><a href="#sec-5-1-6">5.1.6. GoalT</a></li>
<li><a href="#sec-5-1-7">5.1.7. TaskInfo</a></li>
<li><a href="#sec-5-1-8">5.1.8. GroupInfo</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. Summary</a></li>
<li><a href="#sec-5-3">5.3. Errors</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Current versions</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>stable api version: v1.0
</li>
<li>development api version: v1.1
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Overview</h2>
<div class="outline-text-2" id="text-2">
<p>
This api is versioned: Galois will endevour to keep at least the
current 'stable' api and the current 'development' api around.  For
simplicity, the version covers the entirity of the service: it is
expected, however, that most types and operations will be the same
between API versions.
</p>

<p>
This document tends towards the pedantic; sorry.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Conventions</h2>
<div class="outline-text-2" id="text-3">
<p>
The URI for all operations include the version number, so
</p>
<pre class="example">
/v1.0/browse/
</pre>
<p>
is the URI for the root 'browse' page.  The latest 'stable' version
will be located at the root, so
</p>
<pre class="example">
/browse
</pre>
<p>
accesses the stable version of browse.
</p>

<p>
In the following, all URIs are relative to the api version, so 
</p>
<pre class="example">
browse/
</pre>
<p>
is understood to be
</p>
<pre class="example">
/v1.0/browse 
</pre>
<p>
for version 1.0 of the API.
</p>

<p>
One notable exception is this document: the latest version is always
</p>
<pre class="example">
/api.html
</pre>
</div>
</div>
