web-prover/doc/api.org
* Terminology and concepts

Below is some of the terminology used in this document.  This is
intended mainly as a reference and should probably be otherwise
skimmed at most.

Note that we try to avoid the term *level* as it is too overloaded to
be useful.  Task, Task Group, and Goal (to a lesser extent) are
invented terms for this project, while the remainder are more-or-less
standard.

- <<<Expression>>> :: A term in the logic.  An expression has a type.
     For example, =x + y=, =x > y=, and =valid_rw a b c= are all
     expression.

- <<<Predicate>>> :: An expression of boolean type.  An
     <<<assertion>>> is a predicate which is related to some program
     point: <<<pre-condition>>>s, <<<post-condition>>>s, and <<<loop invariant>>>s 
     are all assertions.  For example, =x > y= is an
     predicate (and possibly an assertion), but =x + y= is not
     because it does not have boolean type.

     We generally use the terms predicate and assertion
     interchangeably.

     Aside: you may see assertions written elsewhere in
     so-called Hoare-triples:
     : { x > 1 } foo { x > 2 }
     which says that =foo= has a pre-condition of =x > 1= and a
     post-condition of =x > 2=.  Some authors also use this syntax
     to mean that it the triple is true, that is, there exists a proof
     that from states matching the pre-condition, execution of =foo=
     will result in states matching the post-condition.
               
- <<<Schematic variable>>> :: A variable which is to be filled in by
     gameplay.  For example, =foo_I= is a schematic variable.  We
     shall stick to the convention of =foo_I= for an invariant in
     the function =foo=, =foo_P= for the pre-condition of =foo=,
     and =foo_Q= for the post-condition of =foo=.

     Note that a schematic variable typically needs to be applied to a
     number of expressions before it becomes an assertion.  For
     example, =foo_I x y (w + z)= is an assertion.  We call such
     expressions <<<fully applied>>>.

- <<<Assignment>>> :: An expression defining each schematic variable under
                consideration.  For example, 
 : foo_P a b == a > b 
 : foo_Q a == a = 1
                is an assignment to the schematic variables =foo_P= and =foo_Q=.

- <<<Goal>>> :: The smallest level of gameplay.  A goal consists of 
    - a predicate termed the <<<conclusion>>>;
    - a set of predicates termed <<<assumptions>>>;
    - a set of <<<definitions>>> assigning expressions to variables; and
    - a set of <<<free variables>>> which are disjoint from the definitions.

    If a variable appears in an expression, it is one -- and only one
          -- of: a definition, a free variable, or a schematic
          variable. 

    The conclusion of a goal, and any assumption, MAY be a
          schematic variable.

    The goal is the smallest unit of proof, and belongs to a
          task.  A goal may be true or false under a
          particular assignment.  The truth or falsehood of a
          goal under an assignment is checked by a theorem prover
          via the server.

    Note that a schematic variable in a goal is different to both
          definitions and free variables.  Loosely speaking, a
          definition is short-hand for an expression, a schematic
          variable is one we get to choose, while a goal must be
          true for any value of a free variable.

    Aside: Where we need to be precise, we will write a goal using the following syntax
 : forall x, y. { z = x + y }[ x > 0; y > 0 ] ==> z > 0
    where =x, y= are the free variables, =z= is a definition with
    value =x + y=, =x > 0= and =y > 0= are assumptions, and =z > 0=
    is the conclusion.


- <<<Task>>> :: A set of goals.  The goals in a task may be considered
          to be the constraints on an assignment: a <<<satisfying>>>
          assignment is one which makes all goals in a task
          true.  Thus, a successful game session is one which finds a
          satisfying assignment for a particular task.

          A task is associated with a task group.

          Currently a task has a single non-schematic conclusion.
          That is, each goal in the task but one will have a 
          conclusion which is a fully applied schematic.  There
          will also be a goal which has a single assumption which is
          the schematic pre-condition, although this may change.

          The intent here is that the information in the
          non-schematic conclusion will filter back through the
          goals in the task until it reaches the goal with the
          pre-condition assumption.  At this point, the player will
          have constructed a complete assignment and the task can
          be considered finished, assuming the assignment is
          satisfying.

- <<<Task Group>>> :: A set of tasks.  Each task group has an associated
                function and post-condition.  Given a satisfying
                assignment for each task, the server can construct
                a satisfying assignment for the task group, and
                the task group is termed <<<proved>>>. 

                In particular, this means that the server can
                construct a pre-condition for the task group's
                post-condition, which can then be used in later game
                play.

                Each function has a distinguished task group,
                the <<<safety task group>>>.  Proving this task group
                means that the function is safe to call.  The
                over-arching verification goal is to prove this task
                group for all functions in the program.  

                The post-condition of the safety task group is the
                predicate =true=.  

- Function :: A collection of task groups.  Each function is
              associated with a C function.

* API v1.0

