web-prover/doc/api.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Terminology and concepts</h2>
<div class="outline-text-2" id="text-4">
<p>
Below is some of the terminology used in this document.  This is
intended mainly as a reference and should probably be otherwise
skimmed at most.
</p>

<p>
Note that we try to avoid the term <b>level</b> as it is too overloaded to
be useful.  <a href="#Task">Task</a>, <a href="#Task-Group">Task Group</a>, and <a href="#Goal">Goal</a> (to a lesser extent) are
invented terms for this project, while the remainder are more-or-less
standard.
</p>

<dl class="org-dl">
<dt><a id="Expression">Expression</a></dt><dd>A term in the logic.  An <a href="#Expression">expression</a> has a type.
For example, <code>x + y</code>, <code>x &gt; y</code>, and <code>valid_rw a b c</code> are all
<a href="#Expression">expression</a>.
</dd>

<dt><a id="Predicate">Predicate</a></dt><dd>An <a href="#Expression">expression</a> of boolean type.  An
<a id="assertion">assertion</a> is a <a href="#Predicate">predicate</a> which is related to some program
point: <a id="pre-condition">pre-condition</a>s, <a id="post-condition">post-condition</a>s, and <a id="loop-invariant">loop invariant</a>s 
are all assertions.  For example, <code>x &gt; y</code> is an
<a href="#Predicate">predicate</a> (and possibly an <a href="#assertion">assertion</a>), but <code>x + y</code> is not
because it does not have boolean type.

<p>
We generally use the terms <a href="#Predicate">predicate</a> and <a href="#assertion">assertion</a>
interchangeably.
</p>

<p>
Aside: you may see assertions written elsewhere in
so-called Hoare-triples:
</p>
<pre class="example">
{ x &gt; 1 } foo { x &gt; 2 }
</pre>
<p>
which says that <code>foo</code> has a <a href="#pre-condition">pre-condition</a> of <code>x &gt; 1</code> and a
<a href="#post-condition">post-condition</a> of <code>x &gt; 2</code>.  Some authors also use this syntax
to mean that it the triple is true, that is, there exists a proof
that from states matching the <a href="#pre-condition">pre-condition</a>, execution of <code>foo</code>
will result in states matching the <a href="#post-condition">post-condition</a>.
</p>
</dd>

<dt><a id="Schematic-variable">Schematic variable</a></dt><dd>A variable which is to be filled in by
gameplay.  For example, <code>foo_I</code> is a <a href="#Schematic-variable">schematic variable</a>.  We
shall stick to the convention of <code>foo_I</code> for an invariant in
the function <code>foo</code>, <code>foo_P</code> for the <a href="#pre-condition">pre-condition</a> of <code>foo</code>,
and <code>foo_Q</code> for the <a href="#post-condition">post-condition</a> of <code>foo</code>.

<p>
Note that a <a href="#Schematic-variable">schematic variable</a> typically needs to be applied to a
number of expressions before it becomes an <a href="#assertion">assertion</a>.  For
example, <code>foo_I x y (w + z)</code> is an <a href="#assertion">assertion</a>.  We call such
expressions <a id="fully-applied">fully applied</a>.
</p>
</dd>

<dt><a id="Assignment">Assignment</a></dt><dd>An <a href="#Expression">expression</a> defining each <a href="#Schematic-variable">schematic variable</a> under
consideration.  For example, 
<pre class="example">
foo_P a b == a &gt; b 
foo_Q a == a = 1
</pre>
<p>
is an <a href="#Assignment">assignment</a> to the schematic variables <code>foo_P</code> and <code>foo_Q</code>.
</p>
</dd>

<dt><a id="Goal">Goal</a></dt><dd>The smallest level of gameplay.  A <a href="#Goal">goal</a> consists of 
<ul class="org-ul">
<li>a <a href="#Predicate">predicate</a> termed the <a id="conclusion">conclusion</a>;
</li>
<li>a set of predicates termed <a id="assumptions">assumptions</a>;
</li>
<li>a set of <a id="definitions">definitions</a> assigning expressions to variables; and
</li>
<li>a set of <a id="free-variables">free variables</a> which are disjoint from the <a href="#definitions">definitions</a>.
</li>
</ul>
<p>
If a variable appears in an <a href="#Expression">expression</a>, it is one &#x2013; and only one
      &#x2013; of: a definition, a free variable, or a <a href="#Schematic-variable">schematic
      variable</a>. 
</p>

<p>
The <a href="#conclusion">conclusion</a> of a <a href="#Goal">goal</a>, and any assumption, MAY be a
      <a href="#Schematic-variable">schematic variable</a>.
</p>

<p>
The <a href="#Goal">goal</a> is the smallest unit of proof, and belongs to a
      <a href="#Task">task</a>.  A <a href="#Goal">goal</a> may be true or false under a
      particular <a href="#Assignment">assignment</a>.  The truth or falsehood of a
      <a href="#Goal">goal</a> under an <a href="#Assignment">assignment</a> is checked by a theorem prover
      via the server.
</p>

<p>
Note that a <a href="#Schematic-variable">schematic variable</a> in a <a href="#Goal">goal</a> is different to both
      <a href="#definitions">definitions</a> and <a href="#free-variables">free variables</a>.  Loosely speaking, a
      definition is short-hand for an <a href="#Expression">expression</a>, a <a href="#Schematic-variable">schematic
      variable</a> is one we get to choose, while a <a href="#Goal">goal</a> must be
      true for any value of a free variable.
</p>

<p>
Aside: Where we need to be precise, we will write a <a href="#Goal">goal</a> using the following syntax
</p>
<pre class="example">
forall x, y. { z = x + y }[ x &gt; 0; y &gt; 0 ] ==&gt; z &gt; 0
</pre>
<p>
where <code>x, y</code> are the <a href="#free-variables">free variables</a>, <code>z</code> is a definition with
value <code>x + y</code>, <code>x &gt; 0</code> and <code>y &gt; 0</code> are <a href="#assumptions">assumptions</a>, and <code>z &gt; 0</code>
is the <a href="#conclusion">conclusion</a>.
</p>
</dd>
</dl>


<dl class="org-dl">
<dt><a id="Task">Task</a></dt><dd>A set of goals.  The goals in a <a href="#Task">task</a> may be considered
to be the constraints on an <a href="#Assignment">assignment</a>: a <a id="satisfying">satisfying</a>
<a href="#Assignment">assignment</a> is one which makes all goals in a <a href="#Task">task</a>
true.  Thus, a successful game session is one which finds a
<a href="#satisfying">satisfying</a> <a href="#Assignment">assignment</a> for a particular <a href="#Task">task</a>.

<p>
A <a href="#Task">task</a> is associated with a <a href="#Task-Group">task group</a>.
</p>

<p>
Currently a <a href="#Task">task</a> has a single non-schematic <a href="#conclusion">conclusion</a>.
That is, each <a href="#Goal">goal</a> in the <a href="#Task">task</a> but one will have a 
<a href="#conclusion">conclusion</a> which is a <a href="#fully-applied">fully applied</a> schematic.  There
will also be a <a href="#Goal">goal</a> which has a single assumption which is
the schematic <a href="#pre-condition">pre-condition</a>, although this may change.
</p>

<p>
The intent here is that the information in the
non-schematic <a href="#conclusion">conclusion</a> will filter back through the
goals in the <a href="#Task">task</a> until it reaches the <a href="#Goal">goal</a> with the
<a href="#pre-condition">pre-condition</a> assumption.  At this point, the player will
have constructed a complete <a href="#Assignment">assignment</a> and the <a href="#Task">task</a> can
be considered finished, assuming the <a href="#Assignment">assignment</a> is
<a href="#satisfying">satisfying</a>.
</p>
</dd>

<dt><a id="Task-Group">Task Group</a></dt><dd>A set of tasks.  Each <a href="#Task-Group">task group</a> has an associated
function and <a href="#post-condition">post-condition</a>.  Given a <a href="#satisfying">satisfying</a>
<a href="#Assignment">assignment</a> for each <a href="#Task">task</a>, the server can construct
a <a href="#satisfying">satisfying</a> <a href="#Assignment">assignment</a> for the <a href="#Task-Group">task group</a>, and
the <a href="#Task-Group">task group</a> is termed <a id="proved">proved</a>. 

<p>
In particular, this means that the server can
construct a <a href="#pre-condition">pre-condition</a> for the <a href="#Task-Group">task group</a>'s
<a href="#post-condition">post-condition</a>, which can then be used in later game
play.
</p>

<p>
Each function has a distinguished <a href="#Task-Group">task group</a>,
the <a id="safety-task-group">safety task group</a>.  Proving this <a href="#Task-Group">task group</a>
means that the function is safe to call.  The
over-arching verification <a href="#Goal">goal</a> is to prove this <a href="#Task-Group">task
group</a> for all functions in the program.  
</p>

<p>
The <a href="#post-condition">post-condition</a> of the <a href="#safety-task-group">safety task group</a> is the
<a href="#Predicate">predicate</a> <code>true</code>.  
</p>
</dd>

<dt>Function</dt><dd>A collection of <a href="#Task">task</a> groups.  Each function is
associated with a C function.
</dd>
</dl>
</div>
</div>
