web-prover/doc/api.org
** Types

Along with the primitive JSON types (=bool=, =int=, =string=, =array=,
=object= ({})) we have the following opaque types: <<<GroupId>>>,
<<<TaskId>>>, <<<SchematicId>>>, <<<SolutionId>>>, and <<<GoalId>>>
which should not be interpreted outside of the server.

In the following, we write ={ 'field' : Type }= to describe the JSON
object where the member 'field' is an object of type 'Type'.  We write
=[ Type, Type ]= for a fixed size array.

*** <<<TypeT>>>

A pretty-printed representation of an expression's type.

|-------+--------+-------|
| Field | Type   | Notes |
|-------+--------+-------|
| text  | string |       |
|-------+--------+-------|

*** <<<ExprStruct>>>

This is a set of types, differentiated by the 'type' field.  For
example, the following are both valid:

: { 'type' : 'lit', 'text' : '1' }
: { 'type' : 'app', 'id' : 'valid_rw', 'params' : ... }

|---------+-----------+---------------+----------------------------------------------------------------|
| 'type'  | Field     | Type          | Notes                                                          |
|---------+-----------+---------------+----------------------------------------------------------------|
| 'lit'   | text      | string        | A literal                                                      |
|---------+-----------+---------------+----------------------------------------------------------------|
| 'qvar'  | id        | int           | A free variable                                                |
|---------+-----------+---------------+----------------------------------------------------------------|
| 'dvar'  | id        | int           | A definition variable                                          |
|---------+-----------+---------------+----------------------------------------------------------------|
| 'infix' | id        | string        | The operator                                                   |
|         | prec      | int           | The precedence of the operator                                 |
|         | left      | Expr          | The left-hand side of the operation                            |
|         | right     | Expr          | The right-hand side of the operation                           |
|---------+-----------+---------------+----------------------------------------------------------------|
| 'app'   | id        | string        | The function being applied                                     |
|         | params    | array of Expr | The arguments to the function                                  |
|---------+-----------+---------------+----------------------------------------------------------------|
| 'hole'  | id        | SchematicId   | The id of the schematic variable                               |
|         | inputType | string        | One of 'iNormal', 'iPre', 'iPost'                              |
|         | params    | array of Expr | Arguments to the schematic variable                            |
|         | defn      | Expr          | (can be null) The current definition of the schematic variable |
|---------+-----------+---------------+----------------------------------------------------------------|

*** <<<Expr>>>

This type represents an expression.

|--------+--------------+-----------------------------------------------------|
| Field  | Type         | Notes                                               |
|--------+--------------+-----------------------------------------------------|
| struct | ExprStruct   | The body of the expression                          |
| qvars  | array of int | The free variables occuring in the expression       |
| dvars  | array of int | The definition variables occuring in the expression |
|--------+--------------+-----------------------------------------------------|

*** <<<FunSolution>>>

This represents a single solution for a particular post-condition 
task group.

|----------+------------+------------------------------------------|
| Field    | Type       | Notes                                    |
|----------+------------+------------------------------------------|
| id       | SolutionId |                                          |
| selected | bool       | Whether this solution has been selected. |
| pre      | Expr       | The pre-condition for this solution      |
| post     | Expr       | The post-condition for this solution     |
|----------+------------+------------------------------------------|

*** <<<CallInfo>>>

|-----------+----------------------+---------------------------------------------------------------------------------------|
| Field     | Type                 | Notes                                                                                 |
|-----------+----------------------+---------------------------------------------------------------------------------------|
| id        | SchematicId          | Used for both the pre- and post-condition for the function.  See 'hole' in ExprStruct |
| function  | string               |                                                                                       |
| preType   | array of TypeT       | The type of the arugments to the pre-condition                                        |
| postType  | array of TypeT       | The type of the arugments to the pre-condition                                        |
| solutions | array of FunSolution | The solutions available for this function                                             |
|-----------+----------------------+---------------------------------------------------------------------------------------|

