web-prover/doc/api.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> API v1.0</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Types</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Along with the primitive JSON types (<code>bool</code>, <code>int</code>, <code>string</code>, <code>array</code>,
<code>object</code> ({})) we have the following opaque types: <a id="GroupId">GroupId</a>,
<a id="TaskId">TaskId</a>, <a id="SchematicId">SchematicId</a>, <a id="SolutionId">SolutionId</a>, and <a id="GoalId">GoalId</a>
which should not be interpreted outside of the server.
</p>

<p>
In the following, we write <code>{ 'field' : Type }</code> to describe the JSON
object where the member 'field' is an object of type 'Type'.  We write
<code>[ Type, Type ]</code> for a fixed size array.
</p>
</div>

<div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> <a id="TypeT">TypeT</a></h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
A pretty-printed representation of an <a href="#Expression">expression</a>'s type.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Field</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">text</td>
<td class="left">string</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> <a id="ExprStruct">ExprStruct</a></h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
This is a set of types, differentiated by the 'type' field.  For
example, the following are both valid:
</p>

<pre class="example">
{ 'type' : 'lit', 'text' : '1' }
{ 'type' : 'app', 'id' : 'valid_rw', 'params' : ... }
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">'type'</th>
<th scope="col" class="left">Field</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">'lit'</td>
<td class="left">text</td>
<td class="left">string</td>
<td class="left">A literal</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">'qvar'</td>
<td class="left">id</td>
<td class="left">int</td>
<td class="left">A free variable</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">'dvar'</td>
<td class="left">id</td>
<td class="left">int</td>
<td class="left">A definition variable</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">'infix'</td>
<td class="left">id</td>
<td class="left">string</td>
<td class="left">The operator</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">prec</td>
<td class="left">int</td>
<td class="left">The precedence of the operator</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">left</td>
<td class="left"><a href="#Expr">Expr</a></td>
<td class="left">The left-hand side of the operation</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">right</td>
<td class="left"><a href="#Expr">Expr</a></td>
<td class="left">The right-hand side of the operation</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">'app'</td>
<td class="left">id</td>
<td class="left">string</td>
<td class="left">The function being applied</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">params</td>
<td class="left">array of <a href="#Expr">Expr</a></td>
<td class="left">The arguments to the function</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">'hole'</td>
<td class="left">id</td>
<td class="left"><a href="#SchematicId">SchematicId</a></td>
<td class="left">The id of the <a href="#Schematic-variable">schematic variable</a></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">inputType</td>
<td class="left">string</td>
<td class="left">One of 'iNormal', 'iPre', 'iPost'</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">params</td>
<td class="left">array of <a href="#Expr">Expr</a></td>
<td class="left">Arguments to the <a href="#Schematic-variable">schematic variable</a></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">defn</td>
<td class="left"><a href="#Expr">Expr</a></td>
<td class="left">(can be null) The current definition of the <a href="#Schematic-variable">schematic variable</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3"><span class="section-number-4">5.1.3</span> <a id="Expr">Expr</a></h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
This type represents an <a href="#Expression">expression</a>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Field</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">struct</td>
<td class="left"><a href="#ExprStruct">ExprStruct</a></td>
<td class="left">The body of the <a href="#Expression">expression</a></td>
</tr>

<tr>
<td class="left">qvars</td>
<td class="left">array of int</td>
<td class="left">The <a href="#free-variables">free variables</a> occuring in the <a href="#Expression">expression</a></td>
</tr>

<tr>
<td class="left">dvars</td>
<td class="left">array of int</td>
<td class="left">The definition variables occuring in the <a href="#Expression">expression</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-1-4" class="outline-4">
<h4 id="sec-5-1-4"><span class="section-number-4">5.1.4</span> <a id="FunSolution">FunSolution</a></h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
This represents a single solution for a particular <a href="#post-condition">post-condition</a> 
<a href="#Task-Group">task group</a>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Field</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">id</td>
<td class="left"><a href="#SolutionId">SolutionId</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">selected</td>
<td class="left">bool</td>
<td class="left">Whether this solution has been selected.</td>
</tr>

<tr>
<td class="left">pre</td>
<td class="left"><a href="#Expr">Expr</a></td>
<td class="left">The <a href="#pre-condition">pre-condition</a> for this solution</td>
</tr>

<tr>
<td class="left">post</td>
<td class="left"><a href="#Expr">Expr</a></td>
<td class="left">The <a href="#post-condition">post-condition</a> for this solution</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-1-5" class="outline-4">
<h4 id="sec-5-1-5"><span class="section-number-4">5.1.5</span> <a id="CallInfo">CallInfo</a></h4>
<div class="outline-text-4" id="text-5-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Field</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">id</td>
<td class="left"><a href="#SchematicId">SchematicId</a></td>
<td class="left">Used for both the pre- and <a href="#post-condition">post-condition</a> for the function.  See 'hole' in <a href="#ExprStruct">ExprStruct</a></td>
</tr>

<tr>
<td class="left">function</td>
<td class="left">string</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">preType</td>
<td class="left">array of <a href="#TypeT">TypeT</a></td>
<td class="left">The type of the arugments to the <a href="#pre-condition">pre-condition</a></td>
</tr>

<tr>
<td class="left">postType</td>
<td class="left">array of <a href="#TypeT">TypeT</a></td>
<td class="left">The type of the arugments to the <a href="#pre-condition">pre-condition</a></td>
</tr>

<tr>
<td class="left">solutions</td>
<td class="left">array of <a href="#FunSolution">FunSolution</a></td>
<td class="left">The solutions available for this function</td>
</tr>
</tbody>
</table>
</div>
</div>
