web-prover/doc/api.org
*** <<<GoalT>>>

This type contains information about a goal.

|-------------+-------------------------------------------------+-------------------------------------------|
| Field       | Type                                            | Notes                                     |
|-------------+-------------------------------------------------+-------------------------------------------|
| vars        | array of { 'id' : SchematicId, 'type' : TypeT } | The free variables in the goal            |
| defs        | array of { 'id' : SchematicId, 'value' : Expr } | The definitions in the goal               |
| asmps       | array of Expr                                   | The assumptions in the goal               |
| asmpsBoring | array of Expr                                   | The uninteresting assumptions in the goal |
| conc        | Expr                                            | The conclusion of the goal                |
|-------------+-------------------------------------------------+-------------------------------------------|

*** <<<TaskInfo>>>

This type contains information about a task.

|--------+-------------------------------------------------------------------------+--------------------------------------------|
| Field  | Type                                                                    | Notes                                      |
|--------+-------------------------------------------------------------------------+--------------------------------------------|
| name   | { 'function' : string, 'group' : GroupId, 'name' : TaskId }             |                                            |
| inputs | array of { 'id' : SchematicId, 'params' : array of Type, 'def' : Expr } | 'def' may be null                          |
| calls  | array of CallInfo                                                       | The function calls that occur in this task |
| goals  | array of { 'id' : GoalId, 'solved' : bool, goal : GoalT }               |                                            |
|--------+-------------------------------------------------------------------------+--------------------------------------------|
  
*** <<<GroupInfo>>>

This type contains information about a task group.

|-----------------+-------------------------------------+------------------------------------------------------------------------|
| Field           | Type                                | Notes                                                                  |
|-----------------+-------------------------------------+------------------------------------------------------------------------|
| group           | GroupId                             |                                                                        |
| groupPreParams  | array of TypeT                      | The type of the arguments to the pre-condition for this task group     |
| groupPostParams | array of TypeT                      | The type of the arguments to the post-condition for this task group    |
| groupPost       | Expr                                | The post-condition for the task group                                  |
| groupTasks      | array of [ TaskId, array of Expr  ] | The tasks for this task group, along with any submitted pre-conditions |
|-----------------+-------------------------------------+------------------------------------------------------------------------|

