web-prover/doc/api.html

<div id="outline-container-sec-5-1-6" class="outline-4">
<h4 id="sec-5-1-6"><span class="section-number-4">5.1.6</span> <a id="GoalT">GoalT</a></h4>
<div class="outline-text-4" id="text-5-1-6">
<p>
This type contains information about a <a href="#Goal">goal</a>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Field</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">vars</td>
<td class="left">array of { 'id' : <a href="#SchematicId">SchematicId</a>, 'type' : <a href="#TypeT">TypeT</a> }</td>
<td class="left">The <a href="#free-variables">free variables</a> in the <a href="#Goal">goal</a></td>
</tr>

<tr>
<td class="left">defs</td>
<td class="left">array of { 'id' : <a href="#SchematicId">SchematicId</a>, 'value' : <a href="#Expr">Expr</a> }</td>
<td class="left">The <a href="#definitions">definitions</a> in the <a href="#Goal">goal</a></td>
</tr>

<tr>
<td class="left">asmps</td>
<td class="left">array of <a href="#Expr">Expr</a></td>
<td class="left">The <a href="#assumptions">assumptions</a> in the <a href="#Goal">goal</a></td>
</tr>

<tr>
<td class="left">asmpsBoring</td>
<td class="left">array of <a href="#Expr">Expr</a></td>
<td class="left">The uninteresting <a href="#assumptions">assumptions</a> in the <a href="#Goal">goal</a></td>
</tr>

<tr>
<td class="left">conc</td>
<td class="left"><a href="#Expr">Expr</a></td>
<td class="left">The <a href="#conclusion">conclusion</a> of the <a href="#Goal">goal</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-1-7" class="outline-4">
<h4 id="sec-5-1-7"><span class="section-number-4">5.1.7</span> <a id="TaskInfo">TaskInfo</a></h4>
<div class="outline-text-4" id="text-5-1-7">
<p>
This type contains information about a <a href="#Task">task</a>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Field</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">name</td>
<td class="left">{ 'function' : string, 'group' : <a href="#GroupId">GroupId</a>, 'name' : <a href="#TaskId">TaskId</a> }</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">inputs</td>
<td class="left">array of { 'id' : <a href="#SchematicId">SchematicId</a>, 'params' : array of Type, 'def' : <a href="#Expr">Expr</a> }</td>
<td class="left">'def' may be null</td>
</tr>

<tr>
<td class="left">calls</td>
<td class="left">array of <a href="#CallInfo">CallInfo</a></td>
<td class="left">The function calls that occur in this <a href="#Task">task</a></td>
</tr>

<tr>
<td class="left">goals</td>
<td class="left">array of { 'id' : <a href="#GoalId">GoalId</a>, 'solved' : bool, <a href="#Goal">goal</a> : <a href="#GoalT">GoalT</a> }</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-1-8" class="outline-4">
<h4 id="sec-5-1-8"><span class="section-number-4">5.1.8</span> <a id="GroupInfo">GroupInfo</a></h4>
<div class="outline-text-4" id="text-5-1-8">
<p>
This type contains information about a <a href="#Task-Group">task group</a>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Field</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">group</td>
<td class="left"><a href="#GroupId">GroupId</a></td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">groupPreParams</td>
<td class="left">array of <a href="#TypeT">TypeT</a></td>
<td class="left">The type of the arguments to the <a href="#pre-condition">pre-condition</a> for this <a href="#Task-Group">task group</a></td>
</tr>

<tr>
<td class="left">groupPostParams</td>
<td class="left">array of <a href="#TypeT">TypeT</a></td>
<td class="left">The type of the arguments to the <a href="#post-condition">post-condition</a> for this <a href="#Task-Group">task group</a></td>
</tr>

<tr>
<td class="left">groupPost</td>
<td class="left"><a href="#Expr">Expr</a></td>
<td class="left">The <a href="#post-condition">post-condition</a> for the <a href="#Task-Group">task group</a></td>
</tr>

<tr>
<td class="left">groupTasks</td>
<td class="left">array of [ <a href="#TaskId">TaskId</a>, array of <a href="#Expr">Expr</a>  ]</td>
<td class="left">The tasks for this <a href="#Task-Group">task group</a>, along with any submitted pre-conditions</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
