web-prover/doc/api.org
** Summary

This is the list of operations supported by the server. Parameters in URIs will be indicated using a colons (:), so 
: browse/:fun
can be used to access information about =my_c_function= using
: browse/my_c_function

Arguments not encoded in the URL are form-encoded POST arguments.
Note that all the =play/= operations require the =play/start=
operation before they are can be used.

|------------------------------+----------------------------------------------------+-----------------------------------------------+------------------------------------------------------------------------------------------------------|
| URL                          | Arguments                                          | Return type                                   | Summary                                                                                              |
|------------------------------+----------------------------------------------------+-----------------------------------------------+------------------------------------------------------------------------------------------------------|
| browse/                      | None                                               | array of string                               | Returns the available functions                                                                      |
| browse/:fun                  | 'fun' : string                                     | array of GroupInfo                            | Returns information about each task group                                                            |
| posts/forget/:fun/:group     | 'fun' : string, 'group' : GroupId                  | array of GroupInfo                            | Removes the given task group and returns information about each remaining task group                 |
| play/start/:fun/:group/:name | 'fun' : string, 'group' : GroupId, 'name' : TaskId | TaskInfo                                      | Starts a new game session, returning information used to play that task                              |
| play/sendInput               | 'id' : SchematicId, 'value' : string               | { 'expr' : Expr, 'update' : array of GoalId } | Instantiates a schematic variable, returning the set of goals which are no longer true               |
| play/dragInput               | 'srcid' : GoalId, 'destid' : SchematicId           | { 'expr' : string }                           | Returns a candidate instantiation for the given schematic variable as a string (doesn't instantiate) |
| play/finished                | None                                               | { 'finished' : bool, 'useful' : bool }        | Submits the found task solution                                                                      |
| play/reload                  | None                                               | TaskInfo                                      | Retrieves the task play information.                                                                 |
| play/newPost                 | 'fun' : string, 'post' : string                    | { 'result' : GroupId }                        | Submits a new post-condition for the given function.                                                 |
|------------------------------+----------------------------------------------------+-----------------------------------------------+------------------------------------------------------------------------------------------------------|

** Errors
