web-prover/doc/api.html

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Summary</h3>
<div class="outline-text-3" id="text-5-2">
<p>
This is the list of operations supported by the server. Parameters in URIs will be indicated using a colons (:), so 
</p>
<pre class="example">
browse/:fun
</pre>
<p>
can be used to access information about <code>my_c_function</code> using
</p>
<pre class="example">
browse/my_c_function
</pre>

<p>
Arguments not encoded in the URL are form-encoded POST arguments.
Note that all the <code>play/</code> operations require the <code>play/start</code>
operation before they are can be used.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">URL</th>
<th scope="col" class="left">Arguments</th>
<th scope="col" class="left">Return type</th>
<th scope="col" class="left">Summary</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">browse/</td>
<td class="left">None</td>
<td class="left">array of string</td>
<td class="left">Returns the available functions</td>
</tr>

<tr>
<td class="left">browse/:fun</td>
<td class="left">'fun' : string</td>
<td class="left">array of <a href="#GroupInfo">GroupInfo</a></td>
<td class="left">Returns information about each <a href="#Task-Group">task group</a></td>
</tr>

<tr>
<td class="left">posts/forget/:fun/:group</td>
<td class="left">'fun' : string, 'group' : <a href="#GroupId">GroupId</a></td>
<td class="left">array of <a href="#GroupInfo">GroupInfo</a></td>
<td class="left">Removes the given <a href="#Task-Group">task group</a> and returns information about each remaining <a href="#Task-Group">task group</a></td>
</tr>

<tr>
<td class="left">play/start/:fun/:group/:name</td>
<td class="left">'fun' : string, 'group' : <a href="#GroupId">GroupId</a>, 'name' : <a href="#TaskId">TaskId</a></td>
<td class="left"><a href="#TaskInfo">TaskInfo</a></td>
<td class="left">Starts a new game session, returning information used to play that <a href="#Task">task</a></td>
</tr>

<tr>
<td class="left">play/sendInput</td>
<td class="left">'id' : <a href="#SchematicId">SchematicId</a>, 'value' : string</td>
<td class="left">{ '<a href="#Expr">expr</a>' : <a href="#Expr">Expr</a>, 'update' : array of <a href="#GoalId">GoalId</a> }</td>
<td class="left">Instantiates a <a href="#Schematic-variable">schematic variable</a>, returning the set of goals which are no longer true</td>
</tr>

<tr>
<td class="left">play/dragInput</td>
<td class="left">'srcid' : <a href="#GoalId">GoalId</a>, 'destid' : <a href="#SchematicId">SchematicId</a></td>
<td class="left">{ '<a href="#Expr">expr</a>' : string }</td>
<td class="left">Returns a candidate instantiation for the given <a href="#Schematic-variable">schematic variable</a> as a string (doesn't instantiate)</td>
</tr>

<tr>
<td class="left">play/finished</td>
<td class="left">None</td>
<td class="left">{ 'finished' : bool, 'useful' : bool }</td>
<td class="left">Submits the found <a href="#Task">task</a> solution</td>
</tr>

<tr>
<td class="left">play/reload</td>
<td class="left">None</td>
<td class="left"><a href="#TaskInfo">TaskInfo</a></td>
<td class="left">Retrieves the <a href="#Task">task</a> play information.</td>
</tr>

<tr>
<td class="left">play/newPost</td>
<td class="left">'fun' : string, 'post' : string</td>
<td class="left">{ 'result' : <a href="#GroupId">GroupId</a> }</td>
<td class="left">Submits a new <a href="#post-condition">post-condition</a> for the given function.</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Errors</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Simon Winwood</p>
<p class="date">Created: 2014-04-22 Tue 02:16</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.2 (<a href="http://orgmode.org">Org</a> mode 8.2.5h)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>